<a href="https://colab.research.google.com/github/alekhaya99/Pandas_Tutorial/blob/master/Pandas_Tutorial_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
 Object_DataFrame=pd.DataFrame([[1,3],[2,5],[np.nan,np.nan],[6,7]],index=['A','B','C','D'],columns=[1,2])
Object_DataFrame

     1    2
A  1.0  3.0
B  2.0  5.0
C  NaN  NaN
D  6.0  7.0

In [3]:
#In order to do the sum of the columns
Object_DataFrame.sum()

1     9.0
2    15.0
dtype: float64

In [4]:
#Doing sum on the rows
Object_DataFrame.sum(axis='columns')

A     4.0
B     7.0
C     0.0
D    13.0
dtype: float64

In [5]:
Object_DataFrame.sum(axis=1)

A     4.0
B     7.0
C     0.0
D    13.0
dtype: float64

In [6]:
# 'skipna' excludes the Nan values and it is true by default
Object_DataFrame.sum(axis=1,skipna=False)

A     4.0
B     7.0
C     NaN
D    13.0
dtype: float64

In [7]:
d = {'num_legs': [4, 4, 2, 2],
     'num_wings': [0, 0, 2, 2],
     'class': ['mammal', 'mammal', 'mammal', 'bird'],
     'animal': ['cat', 'dog', 'bat', 'penguin'],
     'locomotion': ['walks', 'walks', 'flies', 'walks']}
df = pd.DataFrame(data=d)
df = df.set_index(['class', 'animal', 'locomotion'])
df

                           num_legs  num_wings
class  animal  locomotion
mammal cat     walks              4          0
       dog     walks              4          0
       bat     flies              2          2
bird   penguin walks              2          2

In [8]:
#count the number of NA values
Object_DataFrame.count()

1    3
2    3
dtype: int64

In [9]:
#Compute the set of summary statistics of Series or each DataFrame column
Object_DataFrame.describe()

              1    2
count  3.000000  3.0
mean   3.000000  5.0
std    2.645751  2.0
min    1.000000  3.0
25%    1.500000  4.0
50%    2.000000  5.0
75%    4.000000  6.0
max    6.000000  7.0

In [10]:
#Compute the minimum values
Object_DataFrame.min(axis=1)

A    1.0
B    2.0
C    NaN
D    6.0
dtype: float64

In [11]:
Object_DataFrame.min()

1    1.0
2    3.0
dtype: float64

In [12]:
#Compute the maximum values
Object_DataFrame.max()

1    6.0
2    7.0
dtype: float64

In [13]:

sr = pd.Series([34, 5, 13, 32, 4, 15],index = ['A', 'B', 'C', 'D', 'E', 'F']) 
  
sr

A    34
B     5
C    13
D    32
E     4
F    15
dtype: int64

In [14]:
#Compute the index location at which minimum value is obtained
sr.argmin()

4

In [15]:
#Compute the index location at which maximum value is obtained
sr.argmax()

0

In [16]:
#Computes the index labels at which maximum value is obtained
Object_DataFrame.idxmax()

1    D
2    D
dtype: object

In [17]:
Object_DataFrame.idxmax(axis=1)

A    2.0
B    2.0
C    NaN
D    2.0
dtype: float64

In [18]:
#Computes the index labels at which minimum value is obtained
Object_DataFrame.idxmin(axis=1)

A    1.0
B    1.0
C    NaN
D    1.0
dtype: float64

In [19]:
Object_DataFrame.idxmin()

1    A
2    A
dtype: object

In [20]:
#Computes the sample quantile ranging from 0 to 1
Object_DataFrame.quantile()

1    2.0
2    5.0
Name: 0.5, dtype: float64

In [21]:
#Computes the sum of values
Object_DataFrame.sum()

1     9.0
2    15.0
dtype: float64

In [22]:
Object_DataFrame.sum(axis=1,skipna=False)

A     4.0
B     7.0
C     NaN
D    13.0
dtype: float64

In [23]:
#Compute the mean of the values
Object_DataFrame.mean()

1    3.0
2    5.0
dtype: float64

In [24]:
Object_DataFrame.mean(axis=1)

A    2.0
B    3.5
C    NaN
D    6.5
dtype: float64

In [25]:
#Compute the Arithmetic median of values
Object_DataFrame.median()

1    2.0
2    5.0
dtype: float64

In [26]:
Object_DataFrame.median(axis=1)

A    2.0
B    3.5
C    NaN
D    6.5
dtype: float64

In [27]:
#Compute the mean absolute deviation from mean value
Object_DataFrame.mad()

1    2.000000
2    1.333333
dtype: float64

In [28]:
#Computes the product of all values
Object_DataFrame.prod()

1     12.0
2    105.0
dtype: float64

In [29]:
Object_DataFrame.prod(axis=1)

A     3.0
B    10.0
C     1.0
D    42.0
dtype: float64

In [30]:
#Computes the variance of values
Object_DataFrame.var()

1    7.0
2    4.0
dtype: float64

In [31]:
Object_DataFrame.var(axis=1)

A    2.0
B    4.5
C    NaN
D    0.5
dtype: float64

In [32]:
#Computes the standard deviation of values
Object_DataFrame.std()

1    2.645751
2    2.000000
dtype: float64

In [33]:
Object_DataFrame.std(axis=1)

A    1.414214
B    2.121320
C         NaN
D    0.707107
dtype: float64

In [34]:
#Compute the skewness (third moment) of values
Object_DataFrame.skew()

1    1.457863
2    0.000000
dtype: float64

In [35]:
Object_DataFrame.skew(axis=1)

A   NaN
B   NaN
C   NaN
D   NaN
dtype: float64

In [36]:
#Compute the kurtosis (fourth moment) of values
Object_DataFrame.kurt()

1   NaN
2   NaN
dtype: float64

In [37]:
Object_DataFrame.kurt(axis=1)

A   NaN
B   NaN
C   NaN
D   NaN
dtype: float64

In [38]:
#Compute the cumulative sum 
Object_DataFrame.cumsum()

     1     2
A  1.0   3.0
B  3.0   8.0
C  NaN   NaN
D  9.0  15.0

In [39]:
Object_DataFrame.cumsum(axis=1)

     1     2
A  1.0   4.0
B  2.0   7.0
C  NaN   NaN
D  6.0  13.0

In [40]:
#Compute the cumulative minimum values
Object_DataFrame.cummin()

     1    2
A  1.0  3.0
B  1.0  3.0
C  NaN  NaN
D  1.0  3.0

In [41]:
Object_DataFrame.cummin(axis=1)

     1    2
A  1.0  1.0
B  2.0  2.0
C  NaN  NaN
D  6.0  6.0

In [42]:
#Compute the cumulative maximum values
Object_DataFrame.cummax()

     1    2
A  1.0  3.0
B  2.0  5.0
C  NaN  NaN
D  6.0  7.0

In [43]:
Object_DataFrame.cummax(axis=1)

     1    2
A  1.0  3.0
B  2.0  5.0
C  NaN  NaN
D  6.0  7.0

In [44]:
#Compute the cumulative product values
Object_DataFrame.cumprod()

      1      2
A   1.0    3.0
B   2.0   15.0
C   NaN    NaN
D  12.0  105.0

In [45]:
Object_DataFrame.cumprod(axis=1)

     1     2
A  1.0   3.0
B  2.0  10.0
C  NaN   NaN
D  6.0  42.0

In [46]:
#Computes the first arithmetic difference
Object_DataFrame.diff()

     1    2
A  NaN  NaN
B  1.0  2.0
C  NaN  NaN
D  NaN  NaN

In [47]:
Object_DataFrame.diff(axis=1)

    1    2
A NaN  2.0
B NaN  3.0
C NaN  NaN
D NaN  1.0

In [48]:
#Computes the percent change
Object_DataFrame.pct_change()

     1         2
A  NaN       NaN
B  1.0  0.666667
C  0.0  0.000000
D  2.0  0.400000

In [49]:
Object_DataFrame.pct_change(axis=1)

    1         2
A NaN  2.000000
B NaN  1.500000
C NaN       NaN
D NaN  0.166667

# Unique Values, Value Counts & Membership

# Correlation and Covariance

In [51]:
import pandas_datareader.data as dt

In [53]:
MainData={ticker:dt.get_data_yahoo(ticker) for ticker in ['AAPL','IBM','MSFT','GOOG'] }
MainData

{'AAPL':                   High         Low  ...       Volume   Adj Close
 Date                                ...
 2015-09-08   28.139999   27.580000  ...  219374400.0   25.946814
 2015-09-09   28.504999   27.442499  ...  340043200.0   25.447792
 2015-09-10   28.320000   27.475000  ...  251571200.0   26.006878
 2015-09-11   28.552500   27.940001  ...  199662000.0   26.385771
 2015-09-14   29.222500   28.715000  ...  233453600.0   26.639898
 ...                ...         ...  ...          ...         ...
 2020-08-31  131.000000  126.000000  ...  225702700.0  129.039993
 2020-09-01  134.800003  130.529999  ...  152470100.0  134.179993
 2020-09-02  137.979996  127.000000  ...  200119000.0  131.399994
 2020-09-03  128.839996  120.500000  ...  254723200.0  120.879997
 2020-09-04  123.699997  110.889999  ...  332607163.0  120.959999

 [1259 rows x 6 columns],
 'GOOG':                    High          Low  ...   Volume    Adj Close
 Date                                  ...
 2015-09-08   616.309998   604.119995  ...  2279500   614.659973
 2015-09-09   626.520020   609.599976  ...  1702100   612.719971
 2015-09-10   624.159973   611.429993  ...  1905300   621.349976
 2015-09-11   625.780029   617.419983  ...  1373500   625.770020
 2015-09-14   625.859985   619.429993  ...  1702300   623.239990
 ...                 ...          ...  ...      ...          ...
 2020-08-31  1647.964966  1630.310059  ...  1823400  1634.180054
 2020-09-01  1665.729980  1632.219971  ...  1826700  1660.709961
 2020-09-02  1733.180054  1666.329956  ...  2511200  1728.280029
 2020-09-03  1709.713989  1615.060059  ...  3100800  1641.839966
 2020-09-04  1645.109985  1547.612549  ...  2608568  1591.040039

 [1259 rows x 6 columns],
 'IBM':                   High         Low  ...     Volume   Adj Close
 Date                                ...
 2015-09-08  147.339996  145.660004  ...  3933300.0  117.901871
 2015-09-09  149.039993  144.850006  ...  3407800.0  116.156136
 2015-09-10  147.160004  144.509995  ...  3461700.0  117.077080
 2015-09-11  147.500000  145.669998  ...  3115100.0  118.013985
 2015-09-14  147.369995  145.410004  ...  3226700.0  116.636604
 ...                ...         ...  ...        ...         ...
 2020-08-31  125.250000  123.029999  ...  4827900.0  123.309998
 2020-09-01  123.949997  122.150002  ...  3155300.0  123.400002
 2020-09-02  128.699997  123.580002  ...  6592400.0  128.179993
 2020-09-03  129.949997  123.650002  ...  5711000.0  124.449997
 2020-09-04  125.349998  121.239998  ...  5851861.0  122.300003

 [1259 rows x 6 columns],
 'MSFT':                   High         Low  ...      Volume   Adj Close
 Date                                ...
 2015-09-08   44.000000   43.200001  ...  32469800.0   39.887024
 2015-09-09   44.400002   42.910000  ...  33469500.0   39.141819
 2015-09-10   43.790001   42.750000  ...  31366600.0   39.341743
 2015-09-11   43.590000   42.939999  ...  27132500.0   39.514427
 2015-09-14   43.439999   42.860001  ...  23656000.0   39.114552
 ...                ...         ...  ...         ...         ...
 2020-08-31  228.699997  224.309998  ...  28774200.0  225.529999
 2020-09-01  227.449997  224.429993  ...  25791200.0  227.270004
 2020-09-02  232.860001  227.350006  ...  34080800.0  231.649994
 2020-09-03  229.309998  214.960007  ...  58148900.0  217.300003
 2020-09-04  218.359894  205.190002  ...  56783337.0  214.250000

 [1259 rows x 6 columns]}

In [54]:
Price=pd.DataFrame({ticker:data['Adj Close'] for ticker, data in MainData.items()})
Price

                  AAPL         IBM        MSFT         GOOG
Date
2015-09-08   25.946814  117.901871   39.887024   614.659973
2015-09-09   25.447792  116.156136   39.141819   612.719971
2015-09-10   26.006878  117.077080   39.341743   621.349976
2015-09-11   26.385771  118.013985   39.514427   625.770020
2015-09-14   26.639898  116.636604   39.114552   623.239990
...                ...         ...         ...          ...
2020-08-31  129.039993  123.309998  225.529999  1634.180054
2020-09-01  134.179993  123.400002  227.270004  1660.709961
2020-09-02  131.399994  128.179993  231.649994  1728.280029
2020-09-03  120.879997  124.449997  217.300003  1641.839966
2020-09-04  120.959999  122.300003  214.250000  1591.040039

[1259 rows x 4 columns]

In [56]:
Volume=pd.DataFrame({ticker:data['Volume'] for ticker,data in MainData.items()})
Volume

                   AAPL        IBM        MSFT     GOOG
Date
2015-09-08  219374400.0  3933300.0  32469800.0  2279500
2015-09-09  340043200.0  3407800.0  33469500.0  1702100
2015-09-10  251571200.0  3461700.0  31366600.0  1905300
2015-09-11  199662000.0  3115100.0  27132500.0  1373500
2015-09-14  233453600.0  3226700.0  23656000.0  1702300
...                 ...        ...         ...      ...
2020-08-31  225702700.0  4827900.0  28774200.0  1823400
2020-09-01  152470100.0  3155300.0  25791200.0  1826700
2020-09-02  200119000.0  6592400.0  34080800.0  2511200
2020-09-03  254723200.0  5711000.0  58148900.0  3100800
2020-09-04  332607163.0  5851861.0  56783337.0  2608568

[1259 rows x 4 columns]

In [59]:
Change_In_Price=Price.pct_change()
#Gives the percentage of the last rows
Change_In_Price.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-08-31  0.033912 -0.014072 -0.014766 -0.006221
2020-09-01  0.039833  0.000730  0.007715  0.016234
2020-09-02 -0.020718  0.038736  0.019272  0.040687
2020-09-03 -0.080061 -0.029100 -0.061947 -0.050015
2020-09-04  0.000662 -0.017276 -0.014036 -0.030941

In [60]:
#Compute pairwise correlation of columns, excluding NA/null values. Returns the correlation between Apple and Google Column
Change_In_Price['AAPL'].corr(Change_In_Price['GOOG'])

0.6519762671331927

In [61]:
#Compute pairwise covariance of columns, excluding NA/null values.
Change_In_Price['AAPL'].cov(Change_In_Price['GOOG'])

0.00019812670760679463

In [62]:
#Returns the full correlation as a DataFrame
Change_In_Price.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.501901  0.698478  0.651976
IBM   0.501901  1.000000  0.580395  0.537152
MSFT  0.698478  0.580395  1.000000  0.781827
GOOG  0.651976  0.537152  0.781827  1.000000

In [63]:
#Returns the full covariance as a DataFrame
Change_In_Price.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000341  0.000148  0.000224  0.000198
IBM   0.000148  0.000257  0.000162  0.000142
MSFT  0.000224  0.000162  0.000301  0.000223
GOOG  0.000198  0.000142  0.000223  0.000271

In [64]:
Change_In_Price.corrwith(Volume)

AAPL   -0.100658
IBM    -0.098690
MSFT   -0.053062
GOOG   -0.150853
dtype: float64

In [65]:
Change_In_Price.corrwith(Volume,axis=1)

Date
2015-09-08         NaN
2015-09-09   -0.524639
2015-09-10    0.816071
2015-09-11    0.885326
2015-09-14    0.925331
                ...
2020-08-31    0.967580
2020-09-01    0.911148
2020-09-02   -0.980765
2020-09-03   -0.856394
2020-09-04    0.876204
Length: 1259, dtype: float64

In [66]:
Change_In_Price.corrwith(Change_In_Price.GOOG)

AAPL    0.651976
IBM     0.537152
MSFT    0.781827
GOOG    1.000000
dtype: float64